app/controllers/circles/orders_controller.rb

  def index
    # Show only the orders that haven't been accepted
    @orders = @circle.orders.where(acceptUserName: "-1")
    if @orders.empty?
---
SELECT "orders".* FROM "orders" WHERE "orders"."circle_id" = ? AND "orders"."acceptUserName" = ?  [["circle_id", 2], ["acceptUserName", "-1"]]
SELECT "orders".* FROM "orders" WHERE "orders"."circle_id" = ?  [["circle_id", 1]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."circle_id" = ? AND "orders"."acceptUserName" = ?  [["circle_id", 2], ["acceptUserName", ""]]

  def create
    @order = @circle.orders.new(order_params)
    @order.circleName = @circle.name
    @order.requestUserName = @user.name
    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("name", "circleName", "requestUserName", "acceptUserName", "category", "fromLocation", "toDestination", "instant", "cost", "created_at", "updated_at", "circle_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "name" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["name", "asdfa"], ["updated_at", 2017-04-20 00:14:43 UTC], ["id", 2]]

  def destroy
    @order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 4]]

    def set_order
      @order = @circle.orders.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."circle_id" = ? AND "orders"."id" = ? LIMIT ?  [["circle_id", 2], ["id", 10], ["LIMIT", 1]]

    def set_user
      @user = User.find_by id: session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def load_parent
      @circle = Circle.find(params[:circle_id])
---
SELECT  "circles".* FROM "circles" WHERE "circles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]