app/controllers/circles_controller.rb

SELECT "circles".* FROM "circles"
---
  def index
    @circles = Circle.all

SELECT  "circles".* FROM "circles" WHERE "circles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "circleName" = ?, "circle_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["circleName", "Brunch CLub"], ["circle_id", 1], ["updated_at", 2017-04-21 00:02:44 UTC], ["id", 1]]
---
  def show
    id = params[:id]
    @circle = Circle.find(id)
    @current_user = User.find_by id: session[:user_id]
    @current_user.circleName = @circle.name
    @current_user.circle_id = @circle.id
    @current_user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "circles" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", 2017-04-20 23:29:01 UTC], ["updated_at", 2017-04-20 23:29:01 UTC], ["name", "Timmies"]]
UPDATE "users" SET "circleName" = ?, "circle_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["circleName", "Hope This Works"], ["circle_id", nil], ["updated_at", 2017-04-21 00:04:31 UTC], ["id", 1]]
---
  def create
    @circle = Circle.new(circle_params)
    @current_user = User.find_by id: session[:user_id]
    @current_user.circleName = @circle.name
    @current_user.circle_id = @circle.id
    @current_user.save