app/controllers/sessions_controller.rb

SELECT  "circles".* FROM "circles" WHERE "circles"."circleName" = ? LIMIT ?  [["circleName", "scic"], ["LIMIT", 1]]
SELECT "users"."circleName" FROM "users" WHERE (uid = 1)
---
    def create
        user = User.from_omniauth(env["omniauth.auth"])
        session[:user_id] = user.id
        circleName = User.findCircleName(user.id)