app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "fullName" = ?, "homeLocation" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "zgan@wesleyan.edu"], ["fullName", "zgan"], ["homeLocation", "High Rise"], ["updated_at", 2017-04-28 21:38:59 UTC], ["id", 2]]

    def set_user
      @user = User.find_by id: session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]